In [1]:
import pandas as pd

In [2]:
friends = [{'age':15, 'job':'stu'},
           {'age':25, 'job':'dev'},
           {'age':30, 'job':'tea'}]
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job'])

In [3]:
df

       age  job
John    15  stu
Jenny   25  dev
Nate    30  tea

In [4]:
df.drop(['John', 'Nate'])

       age  job
Jenny   25  dev

없애고 싶은 인덱스의 이름을 적어준다.

그리고 기존 df는 반영 x

In [5]:
df

       age  job
John    15  stu
Jenny   25  dev
Nate    30  tea

삭제된 결과를 기존 결과에 넣고 싶으면 아래와 같이 하면 된다.

In [6]:
df = df.drop(['John', 'Nate'])

In [7]:
df

       age  job
Jenny   25  dev

In [8]:
friends = [{'age':15, 'job':'stu'},
           {'age':25, 'job':'dev'},
           {'age':30, 'job':'tea'}]
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job'])

In [9]:
df

       age  job
John    15  stu
Jenny   25  dev
Nate    30  tea

In [10]:
df.drop(['John', 'Nate'], inplace = True)

In [11]:
df

       age  job
Jenny   25  dev

inplace를 하게 되면 기존 df에 반영 o

In [12]:
friends = [{'name':'John','age':15, 'job':'stu'},
           {'name':'Ben','age':25, 'job':'dev'},
           {'name':'Jenny','age':30, 'job':'tea'}]
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])

In [13]:
df

    name  age  job
0   John   15  stu
1    Ben   25  dev
2  Jenny   30  tea

이제 인덱스에 숫자가 들어감

이때 삭제 방법 - 인덱스

In [14]:
df = df.drop(df.index[[0,2]]) # 0번과 2번 인덱스 삭제

In [15]:
df

  name  age  job
1  Ben   25  dev

In [16]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])

In [18]:
df

    name  age  job
0   John   15  stu
1    Ben   25  dev
2  Jenny   30  tea

어떠한 조건 삭제 - 로우 방법

나이가 20 이상일 때 삭제 -> 컬럼의 value에 따라 삭제

In [19]:
df = df[df.age > 20]

In [20]:
df

    name  age  job
1    Ben   25  dev
2  Jenny   30  tea

In [21]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])

조건 삭제 컬럼 방법

In [22]:
df = df.drop('age', axis = 1) # axis = 1 컬럼 중에서 age를 삭제

In [23]:
df

    name  job
0   John  stu
1    Ben  dev
2  Jenny  tea

In [26]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])

In [27]:
df.drop('age', axis=1, inplace = True) # 기존 df에 반영

In [28]:
df

    name  job
0   John  stu
1    Ben  dev
2  Jenny  tea